# 01. Importing Libraries

In [40]:
#import libraries - pandas, numpy, os
import pandas as pd
import numpy as np
import os

# 02 Importing Data

In [41]:
#Creating a path to the root directory for this project
path = r"C:\Users\solza\Downloads\12-2022 Instacart Basket Analysis"

In [42]:
#Importing orders.csv to df via pandas.read_csv and os.path.join
df_ords = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'orders.csv'), index_col = False)

In [43]:
#Importing products.csv to df_prods
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'products.csv'), index_col = False)

# 03 Data wrangling

# Drop a column

In [44]:
#Dropping eval_set column from orders.csv
df_ords.drop(columns = ['eval_set'])

,order_id,user_id,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0
...,...,...,...,...,...,...
3421078,2266710,206209,10,5,18,29.0
3421079,1854736,206209,11,4,10,30.0
3421080,626363,206209,12,1,12,18.0
3421081,2977660,206209,13,1,12,7.0
3421082,272231,206209,14,6,14,30.0

# missing value count

In [45]:
#missing value count of "days_since_prior_order"
df_ords['days_since_prior_order'].value_counts(dropna = False)

30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
NaN     206209
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: days_since_prior_order, dtype: int64

In [46]:
#Frequency count of "days_since_prior_order"
df_ords['days_since_prior_order'].value_counts()

30.0    369323
7.0     320608
6.0     240013
4.0     221696
3.0     217005
5.0     214503
2.0     193206
8.0     181717
1.0     145247
9.0     118188
14.0    100230
10.0     95186
13.0     83214
11.0     80970
12.0     76146
0.0      67755
15.0     66579
16.0     46941
21.0     45470
17.0     39245
20.0     38527
18.0     35881
19.0     34384
22.0     32012
28.0     26777
23.0     23885
27.0     22013
24.0     20712
25.0     19234
29.0     19191
26.0     19016
Name: days_since_prior_order, dtype: int64

# change data type

In [47]:
#changing a variable data tybe
df_ords['order_id'] = df_ords['order_id'].astype('str')

In [48]:
df_ords['order_id'].dtype

dtype('O')

# renaming

In [49]:
#rename a column
df_ords.rename(columns = {'order_dow' : 'orders_day_of_week'}, inplace = True)

# transposing

In [50]:
#Import departments data
df_dep = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'departments.csv'), index_col = False)

In [51]:
#Transpose dateframe
df_dep_T = df_dep.T

In [52]:
#Reset an index to the dataframe
df_dep_T.reset_index()

            index                0
0   department_id       department
1               1           frozen
2               2            other
3               3           bakery
4               4          produce
5               5          alcohol
6               6    international
7               7        beverages
8               8             pets
9               9  dry goods pasta
10             10             bulk
11             11    personal care
12             12     meat seafood
13             13           pantry
14             14        breakfast
15             15     canned goods
16             16       dairy eggs
17             17        household
18             18           babies
19             19           snacks
20             20             deli
21             21          missing

In [53]:
#Grab a specific row via index number
df_dep_T.iloc[0]

0    department
Name: department_id, dtype: object

In [54]:
#Copies header row
new_header = df_dep_T.iloc[0]

In [55]:
#Creates a new df from row 1 and onward of old df
df_dep_T_new = df_dep_T[1:]

In [56]:
#Set new header
df_dep_T_new.columns = new_header

In [57]:
#Change table name
df_dep_t_new = df_dep_T_new

# data dictionary

In [58]:
#Make a data dictionary from df_dep_t_new
data_dict = df_dep_t_new.to_dict('index')

In [59]:
data_dict = df_dep_t_new.to_dict("index")

In [60]:
data_dict

{'1': {'department': 'frozen'},
 '2': {'department': 'other'},
 '3': {'department': 'bakery'},
 '4': {'department': 'produce'},
 '5': {'department': 'alcohol'},
 '6': {'department': 'international'},
 '7': {'department': 'beverages'},
 '8': {'department': 'pets'},
 '9': {'department': 'dry goods pasta'},
 '10': {'department': 'bulk'},
 '11': {'department': 'personal care'},
 '12': {'department': 'meat seafood'},
 '13': {'department': 'pantry'},
 '14': {'department': 'breakfast'},
 '15': {'department': 'canned goods'},
 '16': {'department': 'dairy eggs'},
 '17': {'department': 'household'},
 '18': {'department': 'babies'},
 '19': {'department': 'snacks'},
 '20': {'department': 'deli'},
 '21': {'department': 'missing'}}

# subset

In [61]:
#Create a subset
df_snacks = df_prods[df_prods['department_id']==19]

In [62]:
df_snacks2 = df_prods.loc[df_prods['department_id']==19]

In [63]:
df_snacks_3 = df_prods.loc[df_prods['department_id'].isin([17,18,19])]

# 4.4 tasks (2 - 11)

In [64]:
#2 change the data type of a column which is not relevant to the data analyses
df_ords['order_id'] = df_ords['order_id'].astype('str')

In [65]:
#3 change a variable name in to more intuitive name
df_ords.rename(columns = {'order_dow' : 'orders_day_of_week'}, inplace = True)

In [66]:
#4 bussiest hour for placing order
df_ords["order_hour_of_day"].value_counts()

10    288418
11    284728
15    283639
14    283042
13    277999
12    272841
16    272553
9     257812
17    228795
18    182912
8     178201
19    140569
20    104292
7      91868
21     78109
22     61468
23     40043
6      30529
0      22758
1      12398
5       9569
2       7539
4       5527
3       5474
Name: order_hour_of_day, dtype: int64

In [67]:
#5 find definition of number 4 in 'department_id'
print(data_dict.get('4'))

{'department': 'produce'}

In [68]:
#6 create a subset of breakfast item from df_prods
df_breakfast = df_prods[df_prods['department_id'] == 14]

In [69]:
df_breakfast.head()

,product_id,product_name,aisle_id,department_id,prices
27,28,Wheat Chex Cereal,121,14,10.1
33,34,NaN,121,14,12.2
67,68,"Pancake Mix, Buttermilk",130,14,13.7
89,90,Smorz Cereal,121,14,3.9
210,211,Gluten Free Organic Cereal Coconut Maple Vanilla,130,14,3.6

In [70]:
#7 dinner parties subset from df_prods
df_dinner_party = df_prods.loc[df_prods['department_id'].isin([5,7,12,20])]

In [71]:
df_prods.loc[df_prods['department_id'].isin([5,7,12,20])]

,product_id,product_name,aisle_id,department_id,prices
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
6,7,Pure Coconut Water With Orange,98,7,4.4
9,10,Sparkling Orange Juice & Prickly Pear Beverage,115,7,8.4
10,11,Peach Mango Juice,31,7,2.8
16,17,Rendered Duck Fat,35,12,17.1
...,...,...,...,...,...
49676,49672,Cafe Mocha K-Cup Packs,26,7,6.5
49679,49675,Cinnamon Dolce Keurig Brewed K Cups,26,7,14.0
49680,49676,Ultra Red Energy Drink,64,7,14.5
49686,49682,California Limeade,98,7,4.3
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3

In [72]:
#8 count of raw for dinner_party
df_dinner_party.shape

(7650, 5)

In [73]:
#9 create a subset for customer with user_id 1.
df_cust_1 = df_ords.loc[df_ords['user_id'] == 1]

In [74]:
df_cust_1.head()

,order_id,user_id,eval_set,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
1,2398795,1,prior,2,3,7,15.0
2,473747,1,prior,3,3,12,21.0
3,2254736,1,prior,4,4,7,29.0
4,431534,1,prior,5,4,15,28.0

In [75]:
#10. Provide basic stats on df_cust_1
df_cust_1.describe()

,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,11.0,11.000000,11.000000,11.000000,10.000000
mean,1.0,6.000000,2.636364,10.090909,19.000000
std,0.0,3.316625,1.286291,3.477198,9.030811
min,1.0,1.000000,1.000000,7.000000,0.000000
25%,1.0,3.500000,1.500000,7.500000,14.250000
50%,1.0,6.000000,3.000000,8.000000,19.500000
75%,1.0,8.500000,4.000000,13.000000,26.250000
max,1.0,11.000000,4.000000,16.000000,30.000000

In [76]:
#12. Export df_ords
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_wrangled.csv'))

In [77]:
#13. Export df_dep_t_new
df_dep_t_new.to_csv(os.path.join(path, '02 Data','Prepared Data', 'department_wrangled.csv'))